```


  # local_file.test will be created
  + resource "local_file" "test" {
      + content              = "Hello world!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "README.md"
      + id                   = (known after apply)
    }

```

Plan: 1 to add, 0 to change, 0 to destroy.